01 Import Libraries and Datasets

In [11]:
#import libraries
import pandas as pd
import numpy as np
import os

In [13]:
#import df_prods
path=r'C:\Users\jonba\OneDrive\Desktop\CareerFoundry\Assessment 4\2024-08-Instacart Basket Analysis'

In [15]:
df_prods=pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'))

In [17]:
#import of df_orders
df_ords=pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'))

02 df_orders Investigation

In [19]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

03 Create a Dataframe Mixed Data Types

In [22]:
#create a dataframe
df_test=pd.DataFrame()

In [23]:
#create a mixed type column
df_test['mix']=['a', 'b', 1, True]

In [27]:
#show first five rows of df_test
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [29]:
#check for mixed type data
for col in df_test.columns.tolist():
    weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[weird]) > 0:
        print(col)

mix

In [31]:
#change datatype in mix to string
df_test['mix'] = df_test['mix'].astype('str')

04 Missing Values

In [34]:
#find null in df_prods
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [36]:
#create a subset of product_name null values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [38]:
#display df_nan
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [40]:
#find shape df_prods
df_prods.shape

(49693, 5)

In [42]:
#create clean subset with non-missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [44]:
df_prods_clean.shape

(49677, 5)

05 Duplicate values

In [47]:
#create dataframe identifying duplicates across rows
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [49]:
#show new dataframe with duplicates
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [51]:
#check shape df_prods_clean.shape
df_prods_clean.shape

(49677, 5)

In [53]:
#create df dropping duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [55]:
#check shape of new df
df_prods_clean_no_dups.shape

(49672, 5)

In [57]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))

06 End of Exercise Task

In [60]:
#describe df_ords
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [65]:
#showing first five rows of df_ords because this helps me double check my thoughts
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

Column unnamed looks to be an index and should be changed to one
Columns order_id and user_id are unique identifiers and should be changed to serial instead of integers
Column order_number there could be an outlier here. The mean is at 17 and the third quartile starts at 23 but the max is 100.
Column orders_days_of_week looks good to me everything is between 0-6
Column order_hour_of_the_day looks good to me everything is between 0-24
Column days_since_prior_order it's count is lower than the other rows meaning there might be missing data. Also the minimum is 0 which means that there were 0 days since the prior order. When I look at this with the first five rows I printed below I see that the NaN corresponds with a customer's first order in the first row. I don't know if this is always the case but I'm guessing it might be 0 because they had never ordered before.

In [67]:
#check for mixed data in df_ords
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_ords[weird]) > 0:
        print(col)

I did not find any mix data columns. When I copied the code from the lesson it gave me an error. I had to change .applymap(type) to .map(type) to get it to run. When I made the change I got the correct answer in the lesson so I hope that change still gives me the right answer.

In [166]:
#find null in df_ords
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
customer_first_order           0
first_order                    0
dtype: int64

Looking at this output, I see there are no other missing data except for days_since_prior_order. I suspect that the missing data in the days_since_prior_order indicates the first order for a customer. 
I don't want to delete these missing values because they contain important information about customers' first orders. I don't want to replace it with the mean or median because the data is accurate. There were zero days since the prior order. I think I want to create a new column containing the values 'first order' or 'not first order' or I could do a column first order and just use the boolean values true or false.

#check frequency of order number 1 to see if hypothesis is correct

In [170]:
df_ords['order_number'].value_counts()

order_number
1      206209
2      206209
3      206209
4      206209
5      182223
        ...
96       1592
97       1525
98       1471
99       1421
100      1374
Name: count, Length: 100, dtype: int64

There are the same number of first orders as there are missing data in the days prior to previous order column.

In [173]:
#define conditions
conditions= [
    df_ords['order_number'] == 1,
    df_ords['order_number'] > 1
]
categories = ['True', 'False']

In [175]:
#create a new column
df_ords['first_order']=np.select(conditions, categories, default='True')

Okay, I am sure this was not the prettiest way to do this at all. But I managed to create a new column and place 'True' if it was the customer's first order and 'False' if it wasn't. I know there had to be a way to make these real boleen values but I didn't figure it out. This will allow me to filter out the first orders from the dataset when I need to look at the days_since_prior_order but maintains the data.

In [178]:
df_ords['first_order'].value_counts()

first_order
False    3214874
True      206209
Name: count, dtype: int64

In [180]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_first_order,first_order
0,0,2539329,1,1,2,8,NaN,True,True
1,1,2398795,1,2,3,7,15.0,False,False
2,2,473747,1,3,3,12,21.0,False,False
3,3,2254736,1,4,4,7,29.0,False,False
4,4,431534,1,5,4,15,28.0,False,False

In [186]:
#drop other column I made
df_ords.drop(columns = ['customer_first_order'])

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0,False
3421079,3421079,1854736,206209,11,4,10,30.0,False
3421080,3421080,626363,206209,12,1,12,18.0,False
3421081,3421081,2977660,206209,13,1,12,7.0,False
3421082,3421082,272231,206209,14,6,14,30.0,False

In [190]:
df_ords=df_ords.drop(columns = ['customer_first_order'])

In [192]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False

In [194]:
#check for duplicates in df_ords
df_dups=df_ords[df_ords.duplicated()]

In [195]:
df_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_order]
Index: []

I didn't find any duplicates but it feels from the exercise that I was supposed to.

In [208]:
#Not sure I did something right so going back. What are these 67,755 zeroes
df_ords['days_since_prior_order'].value_counts()

days_since_prior_order
30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: count, dtype: int64

#07 Looking at days since prior order one more time

In [210]:
#create subset where days since prior order = 0
df_po_zero=df_ords[df_ords['days_since_prior_order']==0]

In [212]:
df_po_zero.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
8,8,2295261,1,9,1,16,0.0,False
43,43,2557754,4,5,5,13,0.0,False
189,189,2148135,17,30,6,15,0.0,False
296,296,965160,24,19,0,16,0.0,False
337,337,3162630,27,24,2,15,0.0,False

Okay after doing this what I figured out is that these zeroes represent two orders in the same day, which is important data. I'm glad I looked at it further.

In [219]:
#export file as ords_new_column.csv
df_ords.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'ords_new_column.csv'))